driver-tests/jmsbc/JMSBCTests/JMSBCJbi/test/JMSInOutTest_Invoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
        xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" 
        xmlns:xsd="http://www.w3.org/1999/XMLSchema"
        xmlns:tns="http://localhost/bpel/JMSInOutTest" 
        xmlns="http://localhost/bpel/JMSInOutTest"> 
    <SOAP-ENV:Header />
    <SOAP-ENV:Body> 
        <partRequest>
            <correlationId>SUN:JMS:CorrelationID:888-888-888</correlationId>
            <aProperty>This is a string property value</aProperty>
            <textPayLoad>This is the text message which will be used to populate the JMS TextMessage text</textPayLoad>
         </partRequest>
    </SOAP-ENV:Body> 
</SOAP-ENV:Envelope>